Repository: lardc/dv_viewer
Catalog: SCME.dbViewer/Properties/Resources.*.resx
Languages: ru_ru

# Code
source: Subject num
ru_ru: № ГП (ППЭ)

# Constructive
source: Constr.
ru_ru: Констр.

source: Delete all filters
ru_ru: Удалить все фильтры

# DeviceClass
source: Class
ru_ru: Класс

# DeviceType
source: Type
ru_ru: Тип

# DevID
source: Device identificator
ru_ru: Идентификатор изделия

# GroupName
source: Job
ru_ru: ПЗ ГП (ППЭ)

source: Item
ru_ru: Код ТМЦ

# MainWindowTitle
source: Work with the data collected by means of MME hardware in the central database.
ru_ru: Работа с данными, собранными средствами КИП СПП в центральной базе данных.

# MmeCode
source: Code MME
ru_ru: КИП СПП

source: No data
ru_ru: Нет данных

source: Profile
ru_ru: Профиль

# ProfileID
source: Profile identificator
ru_ru: Идентификатор профиля

source: Profile name
ru_ru: Профиль

source: Reason
ru_ru: Причина

source: Records:
ru_ru: Записей:

source: Report
ru_ru: Отчёт

# ReportCannotBeGenerated
source: The source data for building a report is empty. Report generation does not make sense.
ru_ru: Исходные данные для построения отчёта отсутствуют. Формирование отчёта не имеет смысла.

# SiOmnity
source: Omnity
ru_ru: УЭС

source: Status
ru_ru: Статус

# Ts
source: Date
ru_ru: Дата

# Usr
source: Operator
ru_ru: Оператор

# Refresh
source: Refresh F5
ru_ru: Обновить F5

source: Print
ru_ru: Печать

source: Code of non match
ru_ru: Код НП

# LoadDataFromDataBaseFault
source: Error loading data from database
ru_ru: Ошибка при загрузке данных из базы данных

source: Copy
ru_ru: Копировать

# Begin
source: To begin
ru_ru: Начать

# Close
source: To close
ru_ru: Завершить

source: Session
ru_ru: Сеанс

source: Authentication
ru_ru: Аутентификация

source: Password
ru_ru: Пароль

source: User
ru_ru: Пользователь

# BitCalculator
source: Manage user permissions
ru_ru: Управлять правами пользователя

# SetAdministrator
source: Set user as admin
ru_ru: Сделать пользователя администратором

source: Select DC user
ru_ru: Выбор пользователя DC

source: First name
ru_ru: Имя

source: Last name
ru_ru: Фамилия

source: Middle name
ru_ru: Отчество

source: Authenticate
ru_ru: Аутентифицировать

source: User credentials
ru_ru: Ввод учётных данных пользователя

source: Set user permissions
ru_ru: Установка разрешений пользователя

source: Work with assembly protocol
ru_ru: Работа с протоколом сборки

# ReadCreateComment
source: Read and create comment
ru_ru: Чтение и создание комментария

source: Create parameter
ru_ru: Создание параметра

source: Edit parameter
ru_ru: Редактирование параметра

source: Reading comments
ru_ru: Чтение комментариев

# SelectAllRecords
source: Select all records shown
ru_ru: Выбрать все записи

source: Delete permissions of user
ru_ru: Удалить разрешения пользователя

source: User selected
ru_ru: Выбран пользователь

source: Manage by self permissions
ru_ru: Управлять своими разрешениями

source: Manage permissions of user
ru_ru: Управлять разрешениями пользователя

# DeviceComments
source: Measurement group comments
ru_ru: Комментарии к группе измерений

source: Comments
ru_ru: Комментарии

source: Set comment for measurement group
ru_ru: Установить комментарий для группы измерений

source: Record date
ru_ru: Дата создания

source: Login
ru_ru: Логин

# DescrEN
source: Description in english
ru_ru: Описание на английском

# DescrRU
source: Description in russian
ru_ru: Описание на русском

source: Name
ru_ru: Имя

# TemperatureCondition
source: Condition of temperature
ru_ru: Температурный режим

source: Um
ru_ru: Ед. изм.

# WorkWithManualInputParams
source: Work with manually entered parameters
ru_ru: Работа с параметрами введёнными вручную

source: Create
ru_ru: Создание

source: Delete
ru_ru: Удаление

source: Edit
ru_ru: Редактирование

# ManualInputParams
source: Manually entered parameters
ru_ru: Параметры введённые вручную

source: Work with comments
ru_ru: Работа с комментариями

source: Manual input param editor
ru_ru: Редактор параметров созданных вручную

source: Data will not be saved.
ru_ru: Данные не будут сохранены.

source: Parameter name not defined.
ru_ru: Имя параметра не определено.

source: Unit measure is not defined.
ru_ru: Единица измерения не определена.

source: No editing object selected.
ru_ru: Объект редактирования не выбран.

source: Object for delete not selected.
ru_ru: Объект для удаления не выбран.

# ConfirmationMessForDeleteManualInputParam
source: Parameter '{0}' and all its saved values ​​will be permanently deleted. Proceed?
ru_ru: Параметр '{0}' и все его сохранённые значения будут безвозвратно удалены. Продолжить?

# WorkWithValueOfManualInputParam
source: Work with value of manually entered parameter
ru_ru: Работа со значением введенного вручную параметра

# ValueOfManuallyEnteredParam
source: Value of manually entered parameter
ru_ru: Значение введенного вручную параметра

source: Edit value of manually entered parameter
ru_ru: Редатирование значения введенного вручную параметра

source: Parameters
ru_ru: Параметры

# SelectedParameterIsNotEditable
source: The selected parameter '{0}' is not editable. The value of this parameter can be obtained by measuring on equipment.
ru_ru: Выбранный параметр '{0}' недоступен для редактирования. Значение данного параметра может быть получено только путём измерения на оборудовании.

source: Delete parameter
ru_ru: Удаление параметра

source: Delete value of manually entered parameter
ru_ru: Удаление значения введенного вручную параметра

source: Create value of manually entered parameter
ru_ru: Создание значения вручную введенного параметра

# SelectedParameterIsNotDeletable
source: The selected parameter '{0}' is not deletable.
ru_ru: Выбранный параметр '{0}' недоступен для удаления.

# PasswordIncorrect
source: The password is incorrect
ru_ru: Неправильный пароль

# PasswordIsIncorrect
source: The password is incorrect or the DC user '{0}' does not exist
ru_ru: Введённый пароль неверен, либо пользователя DC '{0}' не существует

# UserIisNotAnApplicationUser
source: User '{0}' is not an application user '{1}'
ru_ru: Пользователь '{0}' не является пользователем приложения '{1}'

# NoFiltersInstalled
source: No filters installed. Install at least one filter.
ru_ru: Ни один фильтр не установлен. Установите хотя бы один фильтр.

source: Manual add devices
ru_ru: Добавить изделия

source: Create devices
ru_ru: Создание изделий

source: Devices
ru_ru: Изделия

source: Profile description
ru_ru: Описание профиля

source: Date created
ru_ru: Дата создания

source: Manual entry profile
ru_ru: Ввести профиль

source: Select profile
ru_ru: Выбор профиля

source: Version
ru_ru: Версия

# SelectGroupName
source: Select job
ru_ru: Выбор ПЗ

source: not setted
ru_ru: не задано

source: Description of device parameters
ru_ru: Описание параметров ГП (ППЭ)

source: Value
ru_ru: Значение

# ConditionsOfTest
source: Test conditions
ru_ru: Условия теста

source: Device parameters
ru_ru: Параметры изделия

source: Save
ru_ru: Сохранить

source: Deleted
ru_ru: Удалено

source: Allowed number of characters
ru_ru: Допустимое количество символов

# CheckValue
source: Check value of
ru_ru: Проверьте значение

# ValueIsNotGood
source: Value not selected, or not correct
ru_ru: Значение не выбрано, либо не корректно

# StatusByAssemblyProtocol
source: Assembly status
ru_ru: Статус сборки

source: In assembly protocol
ru_ru: Сборка

source: Not in assembly protocol
ru_ru: НЗП

source: Checked device
ru_ru: Выбор изделия

# ProfileBody
source: Body of profile
ru_ru: Тело профиля

# StateAssembly
source: Assembly
ru_ru: Сборка

# StateInitialization
source: Initialization
ru_ru: НЗП

# UnSelectAllRecords
source: Uncheck the all records shown
ru_ru: Снять отметку выбора со всех показанных записей

source: Create assembly protocol
ru_ru: Сформировать протокол сборки

source: Assembly protocol
ru_ru: Протокол сборки

source: Select by number of records
ru_ru: Установить отметку выбора для заданного количества записей

# ValueIsNotInteger
source: The value '{0}' is not an integer
ru_ru: Значение '{0}' не является целым числом

# SelectedToInitState
source: Selected to initialization state
ru_ru: Перевести в состояние 'НЗП'

source: Climatic
ru_ru: Климат

source: Set assembly protocol mode on
ru_ru: Включить режим просмотра протокола сборки

# NoPermissions
source: No permission for this action.
ru_ru: Право на выполение этого дейстаия отсутствует.

# EditAssembly
source: Linker: Edit assembly
ru_ru: Linker: Редактировать сборку

source: Selected data is not for change.
ru_ru: Выбранные данные не подлежат изменению.

# WrongTermalConditions
source: The parameter was not created. The thermal conditions of the measurements and the created parameter do not match.
ru_ru: Параметр не создан. Температурные условия измерений и создаваемого параметра не совпадают.

# ParemeterIsInUse
source: Paremeter '{0}' is in use. The parameter can only be used once.
ru_ru: Параметр '{0}' уже используется. Параметр может быть использован только один раз.

# SubjectNotSetted
source: The "{0}" is {1}. Enter value of "{0}".
ru_ru: "{0}" {1}. Введите значение "{0}".

source: Selected profile parameters:
ru_ru: Параметры выбранного профиля:

source: Save was successful.
ru_ru: Сохранение было успешным.

# DataContainsAnError
source: The entered data contains an error.
ru_ru: Введенные данные содержат ошибку.

# CanReloadList
source: The previously saved list will be loaded from the database instead of the displayed list. Proceed?
ru_ru: Вместо отображаемого списка из базы данных будет загружен другой список. Продолжить?

# DeleteCurrentRecord
source: Delete record
ru_ru: Удалить запись

source: Save failed.
ru_ru: Сохранение не выполнено.

# NameAlreadyExistsInObject
source: The parameter cannot be selected. The value of a parameter with the same name already exists in the editing object.
ru_ru: Параметр не может быть выбран. Значение параметра с таким именем уже имеется в объекте редактирования.

# WorkWithManualParamsOfAssemblyProtocol
source: Work with params of assembly protocol
ru_ru: Работа с параметрами протокола сборки

source: Omnity
ru_ru: КОФ

source: Assembly job
ru_ru: ПЗ сборки

# WrongValueByMask
source: The value '{0}' does not match the mask '{1}'.
ru_ru: Значение '{0}' не соответствует маске ввода '{1}'.

# NotFoundInSL
source: '{0}' not found in SyteLine.
ru_ru: '{0}' не найдено в SyteLine.

# FilterIsNotOn
source: Filter by field "{0}" is off.
ru_ru: Фильтр по полю "{0}" не включен.

source: Operation failed
ru_ru: Операция не выполнена

# Modification
source: Mod.
ru_ru: Мод.

# ProcessedRecordCount
source: Processed record count {0}
ru_ru: Обработано записей {0}

# ReportBuildingError
source: An error was found in the source data for building the report. Reason {0}.
ru_ru: В исходных данных для построения отчёта обнаружена ошибка. Причина {0}.

# DeviceReferences
source: References of devices norms
ru_ru: Справочник норм на изделия

source: References
ru_ru: Справочники

source: Out of range
ru_ru: За пределами диапазона

source: Wrong description
ru_ru: Обозначение не корректно

source: Manage device references
ru_ru: Управление справочником норм на изделия

source: Build
ru_ru: Сформировать

# DeviceTypeEN
source: Type EN
ru_ru: Тип EN

# DeviceTypeRU
source: Type RU
ru_ru: Тип RU

source: Case type
ru_ru: Тип корпуса

source: Work with device references
ru_ru: Работа со справочником норм на изделия

source: Device reference editor
ru_ru: Редактор норм на изделия

# DeleteCancelled
source: The system rejected the delete operation. The number of references to the deletion object is greater than zero.
ru_ru: Система отклонила операцию удаления. Количество ссылок на объект удаления больше нуля.

source: Delete column
ru_ru: Удалить столбец

# DifferentTemperatureModes
source: The temperature mode of the displayed parameters and the selected profile do not match.
ru_ru: Температурный режим отображаемых параметров и выбранного профиля не совпадают.

source: Selected profile
ru_ru: Выбраный профиль

source: Profile of displayed data
ru_ru: Профиль отображаемых данных

# UnknownTemperatureCondition
source: Temperature condition is unknown
ru_ru: Температурный режим профиля не определён.

# NormMaxValue
source: Max value of norms
ru_ru: Норма Max

# NormMinValue
source: Min value of norms
ru_ru: Норма Min

source: Record successfully deleted
ru_ru: Запись успешно удалена

source: Delete selected records
ru_ru: Удалить выбранные записи

source: Selected records deleted successfully.
ru_ru: Выбранные записи успешно удалены.

source: Change prohibited
ru_ru: Изменение запрещено

source: Not created by hand
ru_ru: Не создано вручную

source: Assembly protocols
ru_ru: Протоколы сборки

source: Mode view
ru_ru: Режим просмотра

# ProtocolDescr
source: Protocol num
ru_ru: № протокола

source: List of assembly protocols
ru_ru: Список протоколов сборки

# DeviceCommentsOneString
source: Measurement group comments
ru_ru: Комментарии к группе измерений

# ProcessingIsNotProvided
source: For {0} processing is not provided.
ru_ru: Для {0} обработка не предусмотрена.

# FilterIsNotSingle
source: The number of filters on the field "{0}" is not equal to 1. To perform this action, no more than one filter on the field "{0}" is required.
ru_ru: Количество фильтров по полю "{0}" не равно 1. Для выполнения данного действия необходимо не более одного фильтра по полю "{0}".

# FilterValuesIsNotSingle
source: The number of filter values ​​for the field "{0}" is not equal to 1. To perform this action, no more than one filter value for the field "{0}" is required.
ru_ru: Количество значений фильтра по полю "{0}" не равно 1. Для выполнения данного действия необходимо не более одного значения фильтра по полю "{0}".

# FilterComparisonTypeIsNotEqual
source: Filter comparison type is not '='.
ru_ru: Тип сравнения фильтра не '='.

source: Please authenticate.
ru_ru: Данная операция не может быть выполнена для не известного пользователя. Требуется аутентификация пользователя.

source: Failed to create
ru_ru: Не удалось создать

# FiltersCountIsNotOne
source: The number of actived filters is not equal to 1. Only one filter is required to perform this action.
ru_ru: Количество активных фильтров не равно 1. Для выполнения данного действия требуется только один фильтр.

# SendSelectedToAssemblyProtocol
source: Send selected measurement groups to assembly protocol №
ru_ru: Отправить выбранные группы измерений в протокол сборки №

source: does not exist
ru_ru: не сущкствует

# SelectedSuccessfullySendedToAssemblyProtocol
source: Selected measurement groups was successfully moved to assembly protocol № {0}.
ru_ru: Выбранные группы измерений успешно отправлены в протокол сборки № {0}.

# ReadReason
source: Reading the value of the 'Reason' field
ru_ru: Чтение значения поля 'Причина'

source: Destroy
ru_ru: Уничтожить

# Quantity
source: Quant.
ru_ru: Кол-во

source: Load
ru_ru: Загрузить

source: Data loading failed
ru_ru: Загрузка данных не выполнена

source: Cut
ru_ru: Вырезать

source: Paste
ru_ru: Вставить
